Autodesk.Revit.DB.PrintRange
An enumerated type listing all Print Range types of Print.

Autodesk.Revit.DB.PrintRange.Select
A range that represents a list of selected views and sheets.

Autodesk.Revit.DB.PrintRange.Visible
Visible portion of current window.

Autodesk.Revit.DB.PrintRange.Current
A range that represents just the currently active view.